---
kind: property
id: P:Autodesk.Revit.DB.PrintManager.IsVirtual
source: html/770377c4-7bc4-a468-6b90-082990de8914.htm
---
# Autodesk.Revit.DB.PrintManager.IsVirtual Property

The virtual type in Autodesk Revit.

## Syntax (C#)
```csharp
public VirtualPrinterType IsVirtual { get; }
```